# This is markdown

In [72]:
import pandas as pd

In [73]:
data = [1, 2, 3, 4]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4

In [74]:
student = [["Rudolf", 83], ["Richie", 84],["Cristian", 98], ["Darien", 90], ["Athar", 90]]
data_student = pd.DataFrame(student, columns=["name", "grade"])
print(data_student)

       name  grade
0    Rudolf     83
1    Richie     84
2  Cristian     98
3    Darien     90
4     Athar     90

In [75]:
car = [["BMW", 5], ["Lamborghini", 10], ["Minitruck", 6]]
dataCar = pd.DataFrame(car, columns=["Car", "Available"])
print(dataCar)

           Car  Available
0          BMW          5
1  Lamborghini         10
2    Minitruck          6

In [76]:
newCar = [["Monster Truck", 5], ["Huracan", 15],["Allegro Musisca", 29]]
new_car = pd.DataFrame(newCar, columns=["Car", "Available"])
print(new_car)

               Car  Available
0    Monster Truck          5
1          Huracan         15
2  Allegro Musisca         29

In [77]:
data_all = pd.concat([new_car, dataCar], ignore_index=True)
print(data_all)

               Car  Available
0    Monster Truck          5
1          Huracan         15
2  Allegro Musisca         29
3              BMW          5
4      Lamborghini         10
5        Minitruck          6

In [80]:
data_all.head(2)

               Car  Available
1          Huracan         15
2  Allegro Musisca         29
3              BMW          5
4      Lamborghini         10
5        Minitruck          6

In [82]:
data_all.tail(2)

           Car  Available
4  Lamborghini         10
5    Minitruck          6